In [1]:
import pandas as pd

In [209]:
df=pd.read_csv('National_Universities_Rankings.csv')
df.head()

,index,Name,Location,Rank,Description,Tuition and fees,In-state,Undergrad Enrollment
0,0,Princeton University,"Princeton, NJ",1,"Princeton, the fourth-oldest college in the Un...","$45,320",NaN,"5,402"
1,1,Harvard University,"Cambridge, MA",2,"Harvard is located in Cambridge, Massachusetts...","$47,074",NaN,"6,699"
2,2,University of Chicago,"Chicago, IL",3,"The University of Chicago, situated in Chicago...","$52,491",NaN,"5,844"
3,3,Yale University,"New Haven, CT",3,"Yale University, located in New Haven, Connect...","$49,480",NaN,"5,532"
4,4,Columbia University,"New York, NY",5,"Columbia University, located in Manhattan's Mo...","$55,056",NaN,"6,102"

In [210]:
#1.Find the universities in which undergraduate students were admitted.
l=df[(df['Undergrad Enrollment']!=0) & (df['Undergrad Enrollment'].notnull())]['Name']
l

0                          Princeton University
1                            Harvard University
2                         University of Chicago
3                               Yale University
4                           Columbia University
                         ...
226      University of Massachusetts--Dartmouth
227           University of Missouri--St. Louis
228    University of North Carolina--Greensboro
229          University of Southern Mississippi
230                       Utah State University
Name: Name, Length: 231, dtype: object

In [211]:
#2.List the states along with the cities in which universities located
df[['cities','states']]=df['Location'].str.split(',',expand=True)
df[['Name','states','cities']]

                                         Name states           cities
0                        Princeton University     NJ        Princeton
1                          Harvard University     MA        Cambridge
2                       University of Chicago     IL          Chicago
3                             Yale University     CT        New Haven
4                         Columbia University     NY         New York
..                                        ...    ...              ...
226    University of Massachusetts--Dartmouth     MA  North Dartmouth
227         University of Missouri--St. Louis     MO        St. Louis
228  University of North Carolina--Greensboro     NC       Greensboro
229        University of Southern Mississippi     MS      Hattiesburg
230                     Utah State University     UT            Logan

[231 rows x 3 columns]

In [159]:
#3.List the cities &universities under each state.

In [168]:
#4.How many universities in each state have ranking<50? Print them along with ranking.

In [212]:
#5.How many universities have both out-of state and in-state students?
df[(df['Tuition and fees'].notnull()) & (df['In-state'].notnull())]['Name'].count()

133

In [215]:
#6.How many universities have marginal difference <=$5000 in in-state &out-of state tuition fees.
i=df['In-state'].str.replace(',','').str.split('$',expand=True).fillna(0)
i=i[1].astype('int64')
o=df['Tuition and fees'].str.replace(',','').str.split('$',expand=True).fillna(0)
o=o[1].astype('int64')
df[abs(i-o)<=5000]

,index,Name,Location,Rank,Description,Tuition and fees,In-state,Undergrad Enrollment,cities,states
204,204,South Dakota State University,"Brookings, SD",202,"Founded in 1881, South Dakota State University...","$11,403","$8,172","11,007",Brookings,SD
208,208,University of South Dakota,"Vermillion, SD",202,"Founded in 1862, University of South Dakota is...","$11,688","$8,457","7,435",Vermillion,SD

In [ ]:

7.	List the universities having tuition fee>15000$ and rank between 120 to 170
8.	Find the campuses of universities located in different cities (multiple cities)
9.	Mention the states where out-of state fee is more than in-state students. Print Minimum and Maximum fees.
10.	Find the cities locating top 100 universities.
11.	Find universities with least no of undergraduate students &highest no of graduate students.
12.	Identifying correlations between enrollment numbers and university rank

In [166]:
11,

KeyError: (98, 103, 159, 198)